In [29]:
import pandas as pd

In [30]:
IBM=pd.read_csv('IBM.csv')
IBM.isnull().sum()

Customer                         0
State                            0
Customer Lifetime Value          0
Response                         0
Coverage                         0
Education                        0
Effective To Date                0
EmploymentStatus                 0
Gender                           0
Income                           0
Location Code                    0
Marital Status                   0
Monthly Premium Auto             0
Months Since Last Claim          0
Months Since Policy Inception    0
Number of Open Complaints        0
Number of Policies               0
Policy Type                      0
Policy                           0
Renew Offer Type                 0
Sales Channel                    0
Total Claim Amount               0
Vehicle Class                    0
Vehicle Size                     0
dtype: int64

In [31]:
IBM.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9134 entries, 0 to 9133
Data columns (total 24 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Customer                       9134 non-null   object
 1   State                          9134 non-null   object
 2   Customer Lifetime Value        9134 non-null   float64
 3   Response                       9134 non-null   object
 4   Coverage                       9134 non-null   object
 5   Education                      9134 non-null   object
 6   Effective To Date              9134 non-null   object
 7   EmploymentStatus               9134 non-null   object
 8   Gender                         9134 non-null   object
 9   Income                         9134 non-null   int64
 10  Location Code                  9134 non-null   object
 11  Marital Status                 9134 non-null   object
 12  Monthly Premium Auto           9134 non-null   int64
 13  Months Since Last Claim        9134 non-null   int64
 14  Months Since Policy Inception  9134 non-null   int64
 15  Number of Open Complaints      9134 non-null   int64
 16  Number of Policies             9134 non-null   int64
 17  Policy Type                    9134 non-null   object
 18  Policy                         9134 non-null   object
 19  Renew Offer Type               9134 non-null   object
 20  Sales Channel                  9134 non-null   object
 21  Total Claim Amount             9134 non-null   float64
 22  Vehicle Class                  9134 non-null   object
 23  Vehicle Size                   9134 non-null   object
dtypes: float64(2), int64(6), object(16)
memory usage: 1.7+ MB

In [32]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)
IBM.to_sql("IBM", con =engine)

9134

In [33]:
sql='''

Select * from IBM


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql.head()

,index,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Months Since Policy Inception,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size
0,0,BU79786,Washington,2763.519279,No,Basic,Bachelor,2/24/11,Employed,F,...,5,0,1,Corporate Auto,Corporate L3,Offer1,Agent,384.811147,Two-Door Car,Medsize
1,1,QZ44356,Arizona,6979.535903,No,Extended,Bachelor,1/31/11,Unemployed,F,...,42,0,8,Personal Auto,Personal L3,Offer3,Agent,1131.464935,Four-Door Car,Medsize
2,2,AI49188,Nevada,12887.431650,No,Premium,Bachelor,2/19/11,Employed,F,...,38,0,2,Personal Auto,Personal L3,Offer1,Agent,566.472247,Two-Door Car,Medsize
3,3,WW63253,California,7645.861827,No,Basic,Bachelor,1/20/11,Unemployed,M,...,65,0,7,Corporate Auto,Corporate L2,Offer1,Call Center,529.881344,SUV,Medsize
4,4,HB64268,Washington,2813.692575,No,Basic,Bachelor,2/3/11,Employed,M,...,44,0,1,Personal Auto,Personal L1,Offer1,Agent,138.130879,Four-Door Car,Medsize

# Q.1 Count the total number of customers in the dataset:?

In [8]:
sql='''
SELECT COUNT(*) AS total_customers FROM IBM;

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

   total_customers
0             9134

# Q.2 Find the average customer lifetime value (CLV)?

In [9]:
sql='''
SELECT AVG(`Customer Lifetime Value`) AS avg_clv FROM IBM;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

       avg_clv
0  8004.940475

# Q.3 Retrieve the unique states present in the dataset?

In [11]:
sql='''
SELECT DISTINCT State FROM IBM;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

        State
0  Washington
1     Arizona
2      Nevada
3  California
4      Oregon

# Q.4 Calculate the total income of all customers

In [12]:
sql='''
SELECT SUM(Income) AS total_income FROM IBM;



''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

   total_income
0     343962509

# Q.5 Find the highest income among male customers?

In [13]:
sql='''
SELECT MAX(Income) AS highest_income_male FROM IBM WHERE Gender = 'M';


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

   highest_income_male
0                99981

# Q.6 List the unique education levels and their counts?

In [14]:
sql='''
SELECT Education, COUNT(*) AS count FROM IBM GROUP BY Education;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

              Education  count
0              Bachelor   2748
1               College   2681
2                Doctor    342
3  High School or Below   2622
4                Master    741

# Q.7 SELECT Education, COUNT(*) AS count FROM dataset_table GROUP BY Education?

In [15]:
sql='''
SELECT Response, COUNT(*) AS count FROM IBM GROUP BY Response ORDER BY count DESC LIMIT 1;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

  Response  count
0       No   7826

# Q.8 Calculate the average income by gender

In [16]:
sql='''
SELECT Gender, AVG(Income) AS avg_income FROM IBM GROUP BY Gender;

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

  Gender    avg_income
0      F  38108.176471
1      M  37188.253575

# Q.9 Find the median customer lifetime value (CLV)?

In [18]:
sql='''
SELECT `Customer Lifetime Value` 
FROM IBM 
ORDER BY `Customer Lifetime Value` 
LIMIT 1 
OFFSET (SELECT COUNT(*)/2 FROM IBM);

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

   Customer Lifetime Value
0              5780.182197

# Q.10 Identify the top 5 states with the highest total income?

In [19]:
sql='''
SELECT State, SUM(Income) AS total_income FROM IBM GROUP BY State ORDER BY total_income DESC LIMIT 5;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

        State  total_income
0  California     118310682
1      Oregon      97686494
2     Arizona      63701400
3      Nevada      33841992
4  Washington      30421941

# Q.11 Count the number of employed and unemployed customers?

In [20]:
sql='''
SELECT EmploymentStatus, COUNT(*) AS count FROM IBM GROUP BY EmploymentStatus;

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

  EmploymentStatus  count
0         Disabled    405
1         Employed   5698
2    Medical Leave    432
3          Retired    282
4       Unemployed   2317

# Q.12 Calculate the average claim amount by policy type

In [22]:
sql='''
SELECT Policy, AVG(`Total Claim Amount`) AS avg_claim_amount FROM IBM GROUP BY Policy;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

         Policy  avg_claim_amount
0  Corporate L1        437.787660
1  Corporate L2        439.183340
2  Corporate L3        422.460088
3   Personal L1        441.062637
4   Personal L2        433.757310
5   Personal L3        433.235047
6    Special L1        463.236864
7    Special L2        432.603295
8    Special L3        439.041442

# Q.13 Find the most common vehicle class?

In [24]:
sql='''
SELECT `Vehicle Class`, COUNT(*) AS count FROM IBM GROUP BY `Vehicle Class` ORDER BY count DESC LIMIT 1;

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

   Vehicle Class  count
0  Four-Door Car   4621

# Q.14 List the renewal offer types and their average claim amounts?

In [25]:
sql='''
SELECT `Renew Offer Type`, AVG(`Total Claim Amount`) AS avg_claim_amount FROM IBM GROUP BY `Renew Offer Type`;

''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

  Renew Offer Type  avg_claim_amount
0           Offer1        469.165640
1           Offer2        408.778268
2           Offer3        423.391734
3           Offer4        392.847065

# Q.15 Identify the average income of customers with and without complaints?

In [27]:
sql='''
SELECT 
    CASE 
        WHEN `Number of Open Complaints` > 0 THEN 'With Complaints' 
        ELSE 'No Complaints' 
    END AS complaint_status,
    AVG(Income) AS avg_income 
FROM 
    IBM
GROUP BY 
    complaint_status;


''';

    
IBM_sql = pd.read_sql_query(sql,con=engine)
IBM_sql

  complaint_status    avg_income
0    No Complaints  37575.857694
1  With Complaints  37971.513815